# A. Data Preparation and Cleaning

In this notebook we will attempt to work on the sample data analytics problem offered by Abhishek Agarrwal about Analyzing Sports Data. Link to his Youtube content for this problem https://www.youtube.com/watch?v=8Ku98c2w0Dk&t=21s

### Essential Libraries
First and foremost is importing the relevant libraries

> NumPy : Library for Numeric Computations in Python  
> Pandas : Library for Data Acquisition and Preparation  
> Matplotlib and Seaborn : Library for Data Visualization

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

#Setting the default display options
pd.options.display.max_rows = 999

In [2]:
raw = pd.read_excel('2019_ODI_Cricket_Matches.xlsx')
raw.head()

,Team 1,Team 2,Winner,Margin,Ground,Match Date,Scorecard
0,New Zealand,Pakistan,New Zealand,61 runs,Wellington,2018-01-06,ODI # 3946
1,New Zealand,Pakistan,New Zealand,8 wickets,Nelson,2018-01-09,ODI # 3947
2,U.A.E.,Ireland,Ireland,4 wickets,ICCA Dubai,2018-01-11,ODI # 3948
3,New Zealand,Pakistan,New Zealand,183 runs,Dunedin,2018-01-13,ODI # 3949
4,U.A.E.,Ireland,Ireland,67 runs,ICCA Dubai,2018-01-13,ODI # 3950

In [3]:
raw.shape

(128, 7)

In [4]:
raw.dtypes

Team 1                object
Team 2                object
Winner                object
Margin                object
Ground                object
Match Date    datetime64[ns]
Scorecard             object
dtype: object

In [5]:
#Convert dtypes into strings
col_to_edit = ['Team 1','Team 2','Winner','Margin','Ground']
for col in col_to_edit:
    raw[col] = raw[col].astype('str')

The dataset has 7 columns, namely `Team 1`, `Team 2`, `Winner`, `Margin`, `Ground`, `Match Date`, and `Scorecard`. The first three column indicated which countries were playing and who won. Fourth column can be broken into column `win_by` and `win_margin`. The sixth column can be transformed into `Year`, `Month`, and `Day`. Last column `Scorecard` can be simplified into only number format.

1. Cleaning `Margin` column

In [6]:
raw["win_by"] = raw["Margin"].apply(lambda x: x.split()[-1])
raw["win_margin"] = raw["Margin"].apply(lambda x: x.split()[0])

#As there are some matches that does not have any result, this win_by and win_margin will be NA
raw["win_margin"] = raw["win_margin"].apply(lambda x: "0" if x == "nan" else x)
raw['win_margin'] = raw['win_margin'].astype('int16')

raw.head()

,Team 1,Team 2,Winner,Margin,Ground,Match Date,Scorecard,win_by,win_margin
0,New Zealand,Pakistan,New Zealand,61 runs,Wellington,2018-01-06,ODI # 3946,runs,61
1,New Zealand,Pakistan,New Zealand,8 wickets,Nelson,2018-01-09,ODI # 3947,wickets,8
2,U.A.E.,Ireland,Ireland,4 wickets,ICCA Dubai,2018-01-11,ODI # 3948,wickets,4
3,New Zealand,Pakistan,New Zealand,183 runs,Dunedin,2018-01-13,ODI # 3949,runs,183
4,U.A.E.,Ireland,Ireland,67 runs,ICCA Dubai,2018-01-13,ODI # 3950,runs,67

2. Cleaning `Match Date`

In [7]:
from datetime import datetime as dt

raw["year"] = raw["Match Date"].dt.year
raw["month"] = raw["Match Date"].dt.month
raw["day"] = raw["Match Date"].dt.day

raw.head()

,Team 1,Team 2,Winner,Margin,Ground,Match Date,Scorecard,win_by,win_margin,year,month,day
0,New Zealand,Pakistan,New Zealand,61 runs,Wellington,2018-01-06,ODI # 3946,runs,61,2018,1,6
1,New Zealand,Pakistan,New Zealand,8 wickets,Nelson,2018-01-09,ODI # 3947,wickets,8,2018,1,9
2,U.A.E.,Ireland,Ireland,4 wickets,ICCA Dubai,2018-01-11,ODI # 3948,wickets,4,2018,1,11
3,New Zealand,Pakistan,New Zealand,183 runs,Dunedin,2018-01-13,ODI # 3949,runs,183,2018,1,13
4,U.A.E.,Ireland,Ireland,67 runs,ICCA Dubai,2018-01-13,ODI # 3950,runs,67,2018,1,13

3. Cleaning `Scorecard` and changing dtype into int

In [8]:
raw['score_id'] = raw["Scorecard"].apply(lambda x: x.split()[-1])
raw['score_id'] = raw['score_id'].astype('int16')

raw.head()

,Team 1,Team 2,Winner,Margin,Ground,Match Date,Scorecard,win_by,win_margin,year,month,day,score_id
0,New Zealand,Pakistan,New Zealand,61 runs,Wellington,2018-01-06,ODI # 3946,runs,61,2018,1,6,3946
1,New Zealand,Pakistan,New Zealand,8 wickets,Nelson,2018-01-09,ODI # 3947,wickets,8,2018,1,9,3947
2,U.A.E.,Ireland,Ireland,4 wickets,ICCA Dubai,2018-01-11,ODI # 3948,wickets,4,2018,1,11,3948
3,New Zealand,Pakistan,New Zealand,183 runs,Dunedin,2018-01-13,ODI # 3949,runs,183,2018,1,13,3949
4,U.A.E.,Ireland,Ireland,67 runs,ICCA Dubai,2018-01-13,ODI # 3950,runs,67,2018,1,13,3950

4. Assuming that team name data and ground name data don't have any mispellings, we drop the irrelevant columns.

In [9]:
raw.drop(['Margin','Match Date','Scorecard'],axis=1,inplace=True)

raw.head()

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id
0,New Zealand,Pakistan,New Zealand,Wellington,runs,61,2018,1,6,3946
1,New Zealand,Pakistan,New Zealand,Nelson,wickets,8,2018,1,9,3947
2,U.A.E.,Ireland,Ireland,ICCA Dubai,wickets,4,2018,1,11,3948
3,New Zealand,Pakistan,New Zealand,Dunedin,runs,183,2018,1,13,3949
4,U.A.E.,Ireland,Ireland,ICCA Dubai,runs,67,2018,1,13,3950

In [10]:
raw.tail()

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id
123,Australia,South Africa,South Africa,Hobart,runs,40,2018,11,11,4069
124,New Zealand,Pakistan,no result,Dubai (DSC),nan,0,2018,11,11,4070
125,Bangladesh,West Indies,Bangladesh,Dhaka,wickets,5,2018,12,9,4071
126,Bangladesh,West Indies,West Indies,Dhaka,wickets,4,2018,12,11,4072
127,Bangladesh,West Indies,Bangladesh,Sylhet,wickets,8,2018,12,14,4073

Note that the dates are in an ascending order. THEN there is also matches where no result was obtained. **We then check and count all possible unique winner results.**

In [11]:
raw.Winner.value_counts()

England         17
India           14
Bangladesh      13
Afghanistan     12
South Africa     9
Ireland          8
West Indies      8
New Zealand      8
Pakistan         8
Sri Lanka        6
Zimbabwe         5
Scotland         5
U.A.E.           4
tied             3
Australia        2
no result        2
Netherlands      1
P.N.G.           1
Hong Kong        1
Nepal            1
Name: Winner, dtype: int64

It seems that there are **tied** and **no result** data. We need to check whether they are the same in meaning.

In [12]:
raw[raw.Winner.isin(['tied','no result'])]

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id
50,Zimbabwe,Scotland,tied,Bulawayo,nan,0,2018,3,12,3996
100,Afghanistan,India,tied,Dubai (DSC),nan,0,2018,9,25,4046
106,Sri Lanka,England,no result,Dambulla,nan,0,2018,10,10,4052
113,India,West Indies,tied,Visakhapatnam,nan,0,2018,10,24,4059
124,New Zealand,Pakistan,no result,Dubai (DSC),nan,0,2018,11,11,4070

**Tied** and **no result** might indicate two different occasions, BUT similarly they don't have margin data.

In [13]:
#Preparing for Data Analytics Section

df = raw.copy()
df.head()

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id
0,New Zealand,Pakistan,New Zealand,Wellington,runs,61,2018,1,6,3946
1,New Zealand,Pakistan,New Zealand,Nelson,wickets,8,2018,1,9,3947
2,U.A.E.,Ireland,Ireland,ICCA Dubai,wickets,4,2018,1,11,3948
3,New Zealand,Pakistan,New Zealand,Dunedin,runs,183,2018,1,13,3949
4,U.A.E.,Ireland,Ireland,ICCA Dubai,runs,67,2018,1,13,3950

# B. Data Analytics

### 1. Which country played the most ODIs in 2018?
We will count values for column `Team 1` and `Team 2`, add them and select the top result. In this case, we will create a dictionary to store the counts for each team. Do note that teams can play first or chasing. We assume `Team 1` is playing first while `Team 2` is chasing.

In [14]:
#We try counting value for team 1, converting it into a dataframe in which we need to reset index and edit column name a bit

temp_1 = df['Team 1'].value_counts()
temp_1 = pd.DataFrame(temp_1)
temp_1.reset_index(inplace=True)
temp_1.columns = ['country','counts']

temp_1[:3]

       country  counts
0  Afghanistan      16
1   Bangladesh      15
2  New Zealand      13

In [15]:
#We count value for team 2, converting it into a dataframe in which we need to reset index and edit column name a bit

temp_2 = df['Team 2'].value_counts()
temp_2 = pd.DataFrame(temp_2)
temp_2.reset_index(inplace=True)
temp_2.columns = ['country','counts']

temp_2[:3]

       country  counts
0     Pakistan      18
1      England      16
2  West Indies      15

In [16]:
#creating a dictionary to store counts for every country
country_count = {}

#For Team 1
for country, count in zip(list(temp_1.country),list(temp_1.counts)):
    country_count[country] = country_count.get(country,0) + count

#For Team 2
for country, count in zip(list(temp_2.country),list(temp_2.counts)):
    country_count[country] = country_count.get(country,0) + count
    
print(country_count)

{'Afghanistan': 20, 'Bangladesh': 20, 'New Zealand': 13, 'Sri Lanka': 17, 'Zimbabwe': 26, 'South Africa': 17, 'Ireland': 13, 'England': 24, 'Australia': 13, 'India': 20, 'U.A.E.': 11, 'Hong Kong': 6, 'West Indies': 18, 'Scotland': 11, 'P.N.G.': 4, 'Netherlands': 2, 'Nepal': 3, 'Pakistan': 18}

In [17]:
new_list = []
for country in country_count:
    new_list.append([country,country_count[country]])
    
temp = pd.DataFrame(new_list, columns=['country','counts'])
top_country = temp["country"].iloc[temp.counts.argmax()]
top_count = temp["counts"].iloc[temp.counts.argmax()]

print(f"The country that played the most was {top_country} with {top_count} appearance.")

The country that played the most was Zimbabwe with 26 appearance.

### 2. What are the top 3 countries winning the most ODIs?
We are going to count values in the `Winner` column.

In [18]:
df.Winner.value_counts()[:3]

England       17
India         14
Bangladesh    13
Name: Winner, dtype: int64

### 3. Based on the Ground, Map the country. Take the list from Google.
We will need to check the unique `Ground` locations and map them into their respective country.

In [19]:
df.Ground.unique()

array(['Wellington', 'Nelson', 'ICCA Dubai', 'Dunedin', 'Melbourne',
       'Dhaka', 'Hamilton', 'Brisbane', 'Sydney', 'Adelaide', 'Perth',
       'Durban', 'Centurion', 'Cape Town', 'Sharjah', 'Johannesburg',
       'Port Elizabeth', 'Mount Maunganui', 'Bulawayo', 'Harare',
       'Christchurch', 'Edinburgh', 'The Oval', 'Cardiff', 'Nottingham',
       'Chester-le-Street', 'Manchester', "Lord's", 'Leeds', 'Providence',
       'Basseterre', 'Dambulla', 'Amstelveen', 'Pallekele',
       'Colombo (RPS)', 'Belfast', 'Kuala Lumpur', 'Dubai (DSC)',
       'Abu Dhabi', 'Kimberley', 'Bloemfontein', 'Paarl', 'Guwahati',
       'Visakhapatnam', 'Chattogram', 'Pune', 'Mumbai (BS)',
       'Thiruvananthapuram', 'Hobart', 'Sylhet'], dtype=object)

It will be a hassle if we do one-to-one mapping manually. We will take the data from wikipedia instead.

In [20]:
wiki = pd.read_html('https://en.wikipedia.org/wiki/List_of_cricket_grounds_by_capacity')[0]
wiki.head()

,Rank,Ground,Capacity,City,Country,Home team(s)
0,1,Narendra Modi Stadium,"132,000[1]",Ahmedabad,India,"India, Gujarat"
1,2,Melbourne Cricket Ground,100024,Melbourne,Australia,"Australia, Victoria, Melbourne Stars"
2,3,Eden Gardens,80000,Kolkata,India,"India, Bengal, Kolkata Knight Riders"
3,4,Shaheed Veer Narayan Singh International Crick...,65400,Raipur,India,"India, Chhattisgarh, Delhi Capitals"
4,5,Perth Stadium,61266,Perth,Australia,"Australia, Western Warriors, Perth Scorchers"

In [21]:
wiki_dict = {}
for city, country in zip(list(wiki.City),list(wiki.Country)):
    wiki_dict[city] = country
    
#We added some more city-country pairs
wiki_dict["Lord's"] = "London"
wiki_dict["The Oval"] = "London"
wiki_dict["Dubai (DSC)"] = "U.A.E."
wiki_dict["Colombo (RPS)"] = "Sri Lanka"
wiki_dict["Mumbai (BS)"] = "India"
wiki_dict["ICCA Dubai"] = "U.A.E."
wiki_dict["Nelson"] = "New Zealand"
wiki_dict["Basseterre"] = "Saint Kitts and Nevis"
wiki_dict["Dambulla"] = "Sri Lanka"
wiki_dict["Amstelveen"] = "Netherlands"
wiki_dict["Hamilton"] = "New Zealand"
wiki_dict["Mount Maunganui"] = "New Zealand"
wiki_dict["Dunedin"] = "New Zealand"
wiki_dict["Kuala Lumpur"] = "Malaysia"
wiki_dict["Chattogram"] = "Bangladesh"
wiki_dict["Hobart"] = "Australia"

Now we map this `wiki_dict` into the main dataframe.

In [22]:
df["ground_country"] = df["Ground"].map(wiki_dict)
df.head()

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id,ground_country
0,New Zealand,Pakistan,New Zealand,Wellington,runs,61,2018,1,6,3946,New Zealand
1,New Zealand,Pakistan,New Zealand,Nelson,wickets,8,2018,1,9,3947,New Zealand
2,U.A.E.,Ireland,Ireland,ICCA Dubai,wickets,4,2018,1,11,3948,U.A.E.
3,New Zealand,Pakistan,New Zealand,Dunedin,runs,183,2018,1,13,3949,New Zealand
4,U.A.E.,Ireland,Ireland,ICCA Dubai,runs,67,2018,1,13,3950,U.A.E.

In [23]:
df.ground_country.isnull().value_counts()

False    128
Name: ground_country, dtype: int64

All `Ground` have been successfully mapped.

### 4. Which country has played the most matches in their home ground?
This looks like a bit complicated. But, you just need to match `Team 1` and the `ground_country`

In [24]:
df[df["Team 2"] == df.ground_country]

Empty DataFrame
Columns: [Team 1, Team 2, Winner, Ground, win_by, win_margin, year, month, day, score_id, ground_country]
Index: []

Result above indicated that no `Team 2` are the host for the cricket matches.

In [25]:
df[df["Team 1"] == df.ground_country]["ground_country"].value_counts()[:3]

Bangladesh    11
Zimbabwe      11
Sri Lanka     10
Name: ground_country, dtype: int64

### 5. How was the performance of Sri Lanka?
Performance is measured by how many times it won, lost, drew, or no result.

In [26]:
played = country_count["Sri Lanka"]
won = len(df[df.Winner == "Sri Lanka"])
draw = len(df[((df["Team 1"] == "Sri Lanka") | (df["Team 2"] == "Sri Lanka"))][df.Winner == "tied"])
no_result =  len(df[((df["Team 1"] == "Sri Lanka") | (df["Team 2"] == "Sri Lanka"))][df.Winner == "no result"])
lost = played - won - draw - no_result

print(f"Played: {played}")
print(f"Win: {won}")
print(f"Draw: {draw}")
print(f"Lose: {lost}")
print(f"No Result: {no_result}")

Played: 17
Win: 6
Draw: 0
Lose: 10
No Result: 1

<ipython-input-26-03d6d9901c53>:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  draw = len(df[((df["Team 1"] == "Sri Lanka") | (df["Team 2"] == "Sri Lanka"))][df.Winner == "tied"])
<ipython-input-26-03d6d9901c53>:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  no_result =  len(df[((df["Team 1"] == "Sri Lanka") | (df["Team 2"] == "Sri Lanka"))][df.Winner == "no result"])

### 6. What are the top 3 wins by Runs?

In [27]:
df[df.win_by == "runs"].sort_values('win_margin',ascending=False)[:3]

,Team 1,Team 2,Winner,Ground,win_by,win_margin,year,month,day,score_id,ground_country
74,Zimbabwe,Pakistan,Pakistan,Bulawayo,runs,244,2018,7,20,4020,Zimbabwe
65,England,Australia,England,Nottingham,runs,242,2018,6,19,4011,England
49,Ireland,U.A.E.,Ireland,Harare,runs,226,2018,3,12,3995,Zimbabwe

### 7. What is the month in which most ODIs were played?

In [28]:
df.month.value_counts()[:3]

3     26
1     23
10    14
Name: month, dtype: int64

If you need to access which month and put into some variables, you'll need an extra step.

In [29]:
#Method 1
temp = df.month.value_counts()
temp.idxmax()

3

In [30]:
#Method 2
temp = df.groupby('month')['month'].count()
temp.idxmax()

3

### 8. What is the team which toured most foreign countries?
Since Team 1 may also not be a host country, then it is better to create a dictionary. For Team 2, it is confirmed that they were touring a foreign country.

In [31]:
#For Team 1
temp_1 = df[df['Team 1'] != df.ground_country]['Team 1'].value_counts()
temp_1 = pd.DataFrame(temp_1)
temp_1.reset_index(inplace=True)
temp_1.columns = ['country','counts']

#For Team 2
temp_2 = df['Team 2'].value_counts()
temp_2 = pd.DataFrame(temp_2)
temp_2.reset_index(inplace=True)
temp_2.columns = ['country','counts']

#creating a dictionary to store counts for every country
tour_count = {}

#For Team 1
for country, count in zip(list(temp_1.country),list(temp_1.counts)):
    tour_count[country] = tour_count.get(country,0) + count

#For Team 2
for country, count in zip(list(temp_2.country),list(temp_2.counts)):
    tour_count[country] = tour_count.get(country,0) + count
    
print(tour_count)

{'Afghanistan': 20, 'Ireland': 13, 'Bangladesh': 9, 'Hong Kong': 6, 'New Zealand': 3, 'England': 19, 'West Indies': 18, 'Scotland': 10, 'Sri Lanka': 7, 'India': 15, 'P.N.G.': 4, 'Nepal': 3, 'U.A.E.': 7, 'Pakistan': 18, 'Zimbabwe': 15, 'South Africa': 8, 'Australia': 5}

In [32]:
tour_list = []
for country in tour_count:
    tour_list.append([country,tour_count[country]])
    
temp = pd.DataFrame(tour_list, columns=['country','counts'])
top_country = temp["country"].iloc[temp.counts.argmax()]
top_count = temp["counts"].iloc[temp.counts.argmax()]

print(f"The country that toured the most was {top_country} for {top_count} times.")

The country that toured the most was Afghanistan for 20 times.

### 9. How many cricket matches were played every month?
Simple groupby and aggregate counts will do.

In [33]:
df.groupby('month')['month'].agg('count')

month
1     23
2     13
3     26
6      6
7     12
8     10
9     14
10    14
11     7
12     3
Name: month, dtype: int64

### 10. On which ground were most games played in?
Value counts on `Ground` column

In [34]:
df.Ground.value_counts().idxmax()

'Harare'

### 11. Did India win mostly chasing or playing first?

In [35]:
#number of times winning by chasing
win_times_chase = len(df[(df["Team 2"] == "India") & (df.Winner == 'India')])
win_times_first = len(df[(df["Team 1"] == "India") & (df.Winner == 'India')])

print(f"India won {win_times_chase} times chasing and {win_times_first} times by playing first.")

India won 9 times chasing and 5 times by playing first.

### 12. What are the top 3 countries winning most matches in 2018, show their win% every month.
We will split this question into three parts. 
1. Select the top 3 countries winning most matches. 
2. Count how many times they play and win every month.
3. Store these data into list and create a new dataframe to project them.

**Section 1**

In [36]:
temp = df.Winner.value_counts()
top_three = list(temp.index[:3])
top_three

['England', 'India', 'Bangladesh']

**Section 2A Make a list of how many times they play every month**

In [37]:
temp = []

for months in range(1,13):
    for country in top_three:
        temp.append(len(df[((df["Team 1"] == country) | (df["Team 2"] == country)) & (df.month == months)]))

play_list = []
count = 0
while count != len(temp):
    play_list.append([temp[count],temp[count+1],temp[count+2]])
    count += 3

play_list

[[5, 0, 5],
 [2, 6, 0],
 [3, 0, 0],
 [0, 0, 0],
 [0, 0, 0],
 [6, 0, 0],
 [3, 3, 3],
 [0, 0, 0],
 [0, 6, 6],
 [5, 4, 3],
 [0, 1, 0],
 [0, 0, 3]]

**Section 2B Make a list of how many times they win every month**

In [38]:
temp = []

for months in range(1,13):
    for country in top_three:
        temp.append(len(df[(df.Winner == country) & (df.month == months)]))

win_list = []
count = 0
while count != len(temp):
    win_list.append([temp[count],temp[count+1],temp[count+2]])
    count += 3

win_list

[[4, 0, 3],
 [1, 5, 0],
 [2, 0, 0],
 [0, 0, 0],
 [0, 0, 0],
 [5, 0, 0],
 [2, 1, 2],
 [0, 0, 0],
 [0, 5, 3],
 [3, 2, 3],
 [0, 1, 0],
 [0, 0, 2]]

**Section 3 Calculating Win Percentage and Storing**

To make the calculation, we can either iterate and divide through the list or use pandas to calulcate for win%.

In [39]:
#Using Pandas
column_name1 = ['play_' + x for x in top_three]
column_name2 = ['win_' + x for x in top_three]

temp_1 = pd.DataFrame(play_list, columns = column_name1)
temp_2 = pd.DataFrame(win_list, columns = column_name2)
win_df = pd.concat([temp_1,temp_2], axis = 1)
win_df[:3]

,play_England,play_India,play_Bangladesh,win_England,win_India,win_Bangladesh
0,5,0,5,4,0,3
1,2,6,0,1,5,0
2,3,0,0,2,0,0

In [40]:
#Using Pandas (continued)

column_name3 = ['winrate_' + x for x in top_three]

for i in range(len(top_three)):
    win_df[column_name3[i]] = round(win_df[column_name2[i]] / win_df[column_name1[i]] * 100, 1)

win_df[:3]

,play_England,play_India,play_Bangladesh,win_England,win_India,win_Bangladesh,winrate_England,winrate_India,winrate_Bangladesh
0,5,0,5,4,0,3,80.0,NaN,60.0
1,2,6,0,1,5,0,50.0,83.3,NaN
2,3,0,0,2,0,0,66.7,NaN,NaN

In [41]:
#Using Pandas (continued)
#Drop irrelevant columns and create a column for months

win_df.drop(column_name1 + column_name2,inplace=True,axis=1)
win_df.reset_index(inplace=True)
win_df.rename(columns = {'index':'month'},inplace=True)
win_df['month'] = win_df['month'] + 1
win_df['month'] = win_df['month'].map({1:'January',2:'February',3:'March',4:'April',5:'May',6:'June',7:'July',\
                                       8:'August',9:'September',10:'October',11:'November',12:'December'})

win_df

        month  winrate_England  winrate_India  winrate_Bangladesh
0     January             80.0            NaN                60.0
1    February             50.0           83.3                 NaN
2       March             66.7            NaN                 NaN
3       April              NaN            NaN                 NaN
4         May              NaN            NaN                 NaN
5        June             83.3            NaN                 NaN
6        July             66.7           33.3                66.7
7      August              NaN            NaN                 NaN
8   September              NaN           83.3                50.0
9     October             60.0           50.0               100.0
10   November              NaN          100.0                 NaN
11   December              NaN            NaN                66.7

In [42]:
#Using List Iterations
winrate_list = []

for i in range(len(play_list)):
    temp = [] 
    for j in range(len(column_name1)):
        try:
            temp.append(round(win_list[i][j] / play_list[i][j] * 100 , 1))
        except ZeroDivisionError:
            temp.append(None)
            
    winrate_list.append(temp)
    
winrate_list[:3]

[[80.0, None, 60.0], [50.0, 83.3, None], [66.7, None, None]]

In [43]:
#Using List Iterations (continued)

month_dict = {0:'January',1:'February',2:'March',3:'April',4:'May',5:'June',6:'July',\
              7:'August',8:'September',9:'October',10:'November',11:'December'}
temp = pd.DataFrame(winrate_list,columns = column_name3)
temp.reset_index(inplace=True)
temp.rename(columns = {'index':'month'},inplace=True)
temp['month'] = temp['month'].map(month_dict)

temp

        month  winrate_England  winrate_India  winrate_Bangladesh
0     January             80.0            NaN                60.0
1    February             50.0           83.3                 NaN
2       March             66.7            NaN                 NaN
3       April              NaN            NaN                 NaN
4         May              NaN            NaN                 NaN
5        June             83.3            NaN                 NaN
6        July             66.7           33.3                66.7
7      August              NaN            NaN                 NaN
8   September              NaN           83.3                50.0
9     October             60.0           50.0               100.0
10   November              NaN          100.0                 NaN
11   December              NaN            NaN                66.7

 **Pandas** and **List** method works. In terms of memory usage, the **List** (or Arrays) uses smaller memory size.

### 13. Which teams had lost most of the matches?
Previously we had created the variable `country_count` which stores the number of plays for each country. And with the number of wins we can compute the win percentage. In this case, the lowest indicates the team that had lost the most.

In [44]:
temp_1 = pd.DataFrame(country_count,index=[0])
temp_1 = temp_1.T
temp_1.rename(columns = {0:'plays'},inplace=True)

temp_1[:3]

             plays
Afghanistan     20
Bangladesh      20
New Zealand     13

Note that we have set the `country_name` into index. We need to create a similar transposed dataframe for `win_count` and join them on index.

In [45]:
temp_2 = df.Winner.value_counts()
temp_2 = pd.DataFrame(temp_2)
temp_2.columns = ['win_count']
temp_2[:3]

            win_count
England            17
India              14
Bangladesh         13

In [46]:
temp = pd.concat([temp_1,temp_2],axis=1,join='inner')
temp[:3]

             plays  win_count
Afghanistan     20         12
Bangladesh      20         13
New Zealand     13          8

We have joined the two dataframe we created earlier. Now we compute for the `winrate` and sort from lowest to highest.

In [47]:
temp['winrate'] = round(temp.win_count / temp.plays * 100, 1)
temp.sort_values('winrate',ascending = True)[:3]

           plays  win_count  winrate
Australia     13          2     15.4
Hong Kong      6          1     16.7
Zimbabwe      26          5     19.2

### 14. Did this team loses the match by chasing or playing first?

For this instance, we decided to look the stats for Australia only.

In [48]:
num_chase = len(df[(df["Team 2"] == 'Australia') & (df.Winner != 'Australia')])
num_first = len(df[(df["Team 1"] == 'Australia') & (df.Winner != 'Australia')])

print(f'Australia lost the matches by {num_chase} times chasing and {num_first} times playing first.')

Australia lost the matches by 5 times chasing and 6 times playing first.

## The End